Repository: mapbox/mapbox-gl-native
Catalog: platform/ios/resources/*.lproj/Localizable.strings
Languages: bg, ca, da, de, es, fr, gl, he, hu, ja, ko, lt, pt_br, pt_pt, ru, sv, uk, vi, zh_hans, zh_hant

# ANNOTATION_A11Y_HINT
source: Shows more info
bg: Показва повече инфо
ca: Mostra més informació
da: Vis mere info
de: Mehr Infos anzeigen
es: Muestra más información
fr: Afficher plus d’informations
gl: Amosa máis información
he: מציג מידע נוסף
hu: Több infót mutat
ja: 詳細を伝える
ko: 추가 정보 보기
lt: Rodo daugiau informacijos
pt_br: Mostrar mais informações
pt_pt: Mostra mais informação
ru: Дополнительная информация
sv: Visa mer information
uk: Показати більше інформації
vi: Hiển thị thêm thông tin
zh_hans: 显示信息
zh_hant: 顯示信息

# API_CLIENT_400_DESC
source: The session data task failed. Original request was: %@
bg: Незавършена сесия от данни. Оригинална заявка:%@
ca: La tasca de dades de la sessió ha fallat. La petició original era: %@
da: Denne session kunne ikke gennemføres pga. data fejl. Den oprindelige forespørgsel var: %@
de: Der Data-Task der Sitzung ist fehlgeschlagen. Die ursprüngliche Anfrage war: %@
es: Error en la tarea de datos de sesión. La solicitud original fue: %@
fr: La tâche de session de données a échoué. La requête originale était : %@
he: המידע של המשימה נכשל, הבקשה המקורית הייתה: %@
ko: 세션 데이타 작업 실패. 초기 요청: %@
lt: Užklausa nepavyko. Pradinė užklausa buvo: %@
pt_br: Tarefa de dados da sessão falhou. Requisição original: %@
pt_pt: A tarefa de dados da sessão falhou. O pedido original era: %@
ru: Во время обмена данными произошла ошибка. Оригинал запроса: %@
sv: Förfrågan misslyckades. Originalförfrågan var: %@
vi: Tác vụ lấy dữ liệu của phiên làm việc bị thất bại. Yêu cầu ban đầu là: %@

# API_CLIENT_400_REASON
source: The status code was %ld
bg: Статус код %ld
ca: El codi d’estat era %ld
da: Status koden var %ld
de: Der Statuscode ist %ld
es: El código de estado fue %ld
fr: Le code de statut était %ld
he: סטטוס הקוד היה %ld
hu: A státuszkód %ld volt
ko: 상태 코드 %ld
lt: Būklės kodas: %ld
pt_br: O código de status foi %ld
pt_pt: O código de estado era %ld
ru: Код ответа %ld
sv: Statuskoden var %ld
uk: Код стану %ld
vi: Mã trạng thái là %ld

source: Cancel
bg: Отказ
ca: Cancel·lar
da: Fortryd
de: Abbrechen
es: Cancelar
fr: Annuler
gl: Desbotar
he: ביטול
hu: Mégse
ja: キャンセル
ko: 취소
lt: Atšaukti
pt_br: Cancelar
pt_pt: Cancelar
ru: Отмена
sv: Avbryt
uk: Скасувати
vi: Hủy bỏ
zh_hans: 取消
zh_hant: 取消

# CLOSE_CALLOUT_A11Y_HINT
source: Returns to the map
bg: Обратно към картата
ca: Torna al mapa
da: Retur til kortet
de: Zurück zur Karte
es: Regresa al mapa
fr: Retourne à la carte
gl: Voltar ó mapa
he: חזרה אל המפה
hu: Visszatér a térképhez
ko: 지도로 복귀
lt: Grįžta į žemėlapį.
pt_br: Retornar ao mapa
pt_pt: Voltar ao mapa
ru: Вернуться к карте
sv: Återgår till kartan
uk: Повернення до мапи
vi: Quay lại bản đồ
zh_hant: 回到地圖

# COMPASS_A11Y_HINT
source: Rotates the map to face due north
bg: Завърта картата в посока север
ca: Orienta el mapa amb rumb nord
da: Fast nord
de: Dreht die Karte nach Norden
es: Gira el mapa para hacer frente al norte
fr: Réoriente la carte vers le nord
gl: Xira o mapa para pórse cara o norte
he: קיבוע המפה לצד צפון
hu: Elforgatja a térképet, hogy észak felé nézzen
ja: 地図を真北に回転させる
ko: 정북쪽으로 지도 회전
lt: Pasuka žemėlapį šiaure į viršų
pt_br: Rotaciona o mapa com face ao norte
pt_pt: Rodar o mapa virado para Norte
ru: Развернуть карту на север
sv: Roterar kartan mot norr
uk: Обертає мапу в напрмяку на північ
vi: Quay bản đồ về hướng bắc
zh_hans: 旋转地图使正北朝上
zh_hant: 旋轉地圖使正北朝上

# COMPASS_A11Y_LABEL
source: Compass
bg: Компас
ca: Brúixola
da: Kompas
de: Kompass
es: Brújula
fr: Compas
gl: Compás
he: מצפן
hu: Iránytű
ja: 磁針
ko: 나침반
lt: Kompasas
pt_br: Compasso
pt_pt: Compasso
ru: Компас
sv: Kompass
uk: Компас
vi: La bàn
zh_hans: 指南针
zh_hant: 指南針

# COMPASS_NORTH
source: N
bg: С
he: צ
hu: É
ja: 北
ko: 북
lt: Š
ru: С
uk: Пн
vi: B
zh_hans: 北
zh_hant: 北

# DESIGNABLE
source: To display a Mapbox-hosted map here, set %1$@ to your access token in %2$@ For detailed instructions, see:
bg: За да покажеш Mapbox-хоствана карта тук, задай %1$@ към своя токен за достъп в %2$@ За повече детайли, виж:
ca: Per mostrar aquí un mapa allotjat a Mapbox posa %1$@ al teu token d’accés a %2$@ Per obtenir instruccions detallades, consulteu:
da: For at vise et Mapbox-hosted kort her, angiv %1$@ til din access token i %2$@ For yderligere instruktion se:
de: Um hier eine von Mapbox-Karte anzuzeigen, muss das Zugriffs-Token als %1$@ in %2$@ eingetragen werden. Für detaillierte Informationen, siehe:
es: Para mostrar un mapa alojado en Mapbox aquí, establezca %1$@ con su token de acceso en %2$@ Para obtener instrucciones detalladas, consulte:
fr: Pour afficher ici une carte hébergée par Mapbox, indiquez %1$@ à votre jeton d’accès dans %2$@ Pour des instructions détaillées, voyez :
gl: Para amosar un mapa aloxado no Mapbox aquí, estabelece %1$@ co teu 'token' de acceso en %2$@ Para obter instrucións detalladas, olla:
he: בכדי להציג את המפות המאוכסנות של Mapbox כאן, הגדר %1$@ את אסימון הגישה ב %2$@ להוראות מפורטות, ראה:
ko: 맵박스에의한 지도를 출력하기 위해, %1$@ 를 %2$@에 당신의 접근 토큰으로 으로 설정하십시오. 자세한 정보를 찾으시는 경우, 확인:
lt: Nustatykite %1$@ kaip jūsų prieigos raktą %2$@ byloje tam, kad atvaizduoti žemėlapį patalpintą Mapbox. Daugiau informacijos:
pt_br: Para exibir um mapa hospedado no Mapbox aqui, insira %1$@ para seu token de acesso %2$@ Para maiores detalhes, veja:
pt_pt: Para mostrar aqui um mapa alojado na Mapbox, configure %1$@ para o seu token de acesso em %2$@ Para instruções detalhadas, ver:
ru: Для отображения здесь карт Mapbox, задайте %1$@ для вашего токена доступа в %2$@ Подробные инструкции:
sv: För att visa Mapbox-karta här, fyll i %1$@ till din access token i %2$@ För detaljerad information, se:
uk: Для показу мапи від Mapbox тут, встановіть %1$@ для вашої мітки доступу в %2$@ Для отримання докладних інструкцій дивіться:
vi: Để hiển thị bản đồ do Mapbox phục vụ tại đây, đặt %1$@ là dấu hiệu truy cập của bạn trong %2$@ Xem hướng dẫn chi tiết tại:
zh_hans: 在%2$@中将你的access token设为%1$@可在这里显示Mapbox上的地图 更多说明请见
zh_hant: 在%2$@中將你的access token設爲%1$@即可顯示Mapbox上的地圖 更多說明請見

# INFO_A11Y_HINT
source: Shows credits, a feedback form, and more
bg: Показва благодарности, форма за обратна връзка и още
ca: Mostra els crèdits, el formulari de contacte i més
da: Vis credits, feedback formular med mere
de: Zeigt Danksagunen, ein Kontakformular und mehr an
es: Muestra créditos, un formulario de comentarios y más
fr: Affiche les crédits d’auteurs, un formulaire de retour d’avis et plus encore
gl: Amosa os cretos, un formulario de opinións e máis
he: מציג קרדיטים, טופס משוב ועוד
ko: 크레딧, 피드백 폼, 기타 보기
lt: Rodo kūrėjų sąrašą, grįžtamo ryšio formą ir daugiau.
pt_br: Mostra os créditos, um formulário de avaliação, e mais
pt_pt: Mostra os créditos, um formulário de resposta e mais
ru: Показать благодарности, форму отправки отзыва и другое
sv: Visa mer
uk: Показує інформацію про розробників, форму зворотнього відгуку та інше
vi: Hiển thị lời ghi công, biểu mẫu phản hồi, và thêm nữa
zh_hans: 显示致谢、用户反馈及更多
zh_hant: 顯示致謝、用戶意見表及更多

# INFO_A11Y_LABEL
source: About this map
bg: За тази карта
ca: Sobre aquest mapa
da: Om kortet
de: Über diese Karte
es: Acerca de este mapa
fr: À propos de cette carte
gl: Acerca deste mapa
he: אודות המפה
hu: Erről a térképről
ja: この地図について
ko: 이 맵에 관하여
lt: Apie šį žemėlapį
pt_br: Sobre este mapa
pt_pt: Sobre este mapa
ru: Об этой карте
sv: Om den här kartan
uk: Про цю мапу
vi: Giới thiệu về bản đồ này
zh_hans: 关于这个地图
zh_hant: 關於這個地圖

# LOAD_MAP_FAILED_DESC
source: The map failed to load because an unknown error occurred.
bg: Картата не се зареди поради неизвестна грешка.
ca: El mapa no s’ha carregat a causa d’un error desconegut.
da: Kortet kunne ikke hentes på grund af en ukendt fejl
de: Die Karte konnte nicht geladen werden, da ein unbekannter Fehler aufgetreten ist.
es: No se pudo cargar el mapa debido a un error desconocido.
fr: Le chargement de la carte a échoué car une erreur inconnue est survenue.
gl: Non se puido cargar o mapa por mor dun error descoñecido.
he: טעינת המפה נכשלה עכב שגיאה לא ידועה.
hu: Nem sikerült betölteni a térképet, mert ismeretlen hiba történt.
ko: 알수 없는 에러로 인해 맵 로드에 실패하였습니다.
lt: Nepavyko užkrauti žemėlapio dėl nežinomos klaidos.
pt_br: Falha ao carregar mapa devido a um erro desconhecido
pt_pt: Não foi possível carregar o mapa porque ocorreu um erro desconhecido.
ru: Не удалось загрузить карту из-за неизвестной ошибки.
sv: Misslyckades med att ladda kartan på grund av ett okänt fel.
uk: Через невідому помилку неможливо завантажити мапу
vi: Bản đồ bị thất bại khi tải vì lỗi không rõ.
zh_hant: 發生不知名的錯誤，無法載入地圖。

# LOAD_STYLE_FAILED_DESC
source: The map failed to load because the style can't be loaded.
bg: Картата не се зареди поради незареждане на стила.
ca: El mapa no s’ha carregat perquè l’estil no es pot carregar.
da: Kortet kunne ikke hentes på grund af en fejl i kort formatteringen
de: Die Karte konnte nicht geladen werden, da diese Form nicht geladen werden kann
es: No se pudo cargar el mapa debido a un error de carga en el estilo.
fr: Le chargement de la carte a échoué car le style n’a pas pu être chargé.
gl: Non se puido cargar o mapa por mor dun erro de carga no estilo.
he: טעינת המפה נכשלה - לא ניתן לטעון את הסגנון.
hu: Nem sikerült betölteni a térképet, mert a stílust nem lehetett betölteni.
ko: 형식이 로드되지 않아, 맵 로드에 실패하였습니다.
lt: Nepavyko užkrauti žemėlapio, nes nepavyko užkrauti stiliaus.
pt_br: Falha ao carregar mapa porque o estilo não pode ser carregado
pt_pt: Não foi possível carregar o mapa porque o estilo não pode ser carregado.
ru: Не удалось загрузить карту из-за ошибки загрузки стиля.
sv: Misslyckades med att ladda kartan på grund av att kartstilen kunde inte laddas.
uk: Збій мапи через те, що неможливо завантажити стиль
vi: Bản đồ bị thất bại khi tải vì không thể tải bảng kiểu.
zh_hant: 載入樣式表時發生錯誤，無法載入地圖。

# LOGO_A11Y_LABEL
source: Mapbox
ko: 맵박스

# MAP_A11Y_LABEL
source: Map
bg: Карта
ca: Mapa
da: Kort
de: Karte
es: Mapa
fr: Carte
gl: Mapa
he: מפה
hu: Térkép
ja: 地図
ko: 지도
lt: Žemėlapis
pt_br: Mapa
pt_pt: Mapa
ru: Карта
sv: Karta
uk: Мапа
vi: Bản đồ
zh_hans: 地图
zh_hant: 地圖

# MAP_A11Y_VALUE_ANNOTATIONS
source: %ld annotation(s) visible.
bg: %ld видима анотация(и).
da: %ld synlige kommentarer.
es: %ld anotacion(es) visible(s).
fr: %ld annotation(s) visible(s).
gl: %ld anotación(s) visíbel(s).
he: %ld נקודה(ות) ציון מוצגות.
ko: %ld 주석 볼 수 있는.
pt_pt: %ld erro(s) reportado(s) visível(is).
ru: Показано %ld аннотаций.
sv: %ld annotering(ar) synliga.
uk: %ld підпис(ів) видно.
vi: %ld chú thích đang xuất hiện.

# MAP_A11Y_VALUE_PLACES
source: Places visible: %@.
bg: Видими места: %@.
da: Synlige steder: %@.
es: Lugares visibles: %@.
fr: Lieux visibles : %@.
gl: Lugares visíbeis: %@.
he: מקומות מוצגים: %@.
ko: 가시거리 범위: %@.
pt_pt: Locais visíveis: %@.
ru: Показано мест: %@.
sv: Synliga platser: %@.
uk: Показано місць: %@
vi: Địa điểm đang xuất hiện: %@.

# MAP_A11Y_VALUE_ROADS
source: %ld road(s) visible.
bg: %ld видим път(я).
da: %ld synlige veje.
es: %ld camino(s) visible(s).
fr: %ld route(s) visible(s).
gl: %ld estrada(s) visíbel(s).
he: %ld דרך(ים) מוצגות.
ko: %ld 도로 볼 수 있는.
pt_pt: %ld estrada(s) visivel(is).
ru: Показано %ld дорог.
sv: %ld väg(ar) synliga.
uk: %ld доріг видно.
vi: %ld con đường đang xuất hiện.

# MAP_A11Y_VALUE_ZOOM
source: Zoom %dx.
bg: Мащаб %dx.
fr: Zoom %d×.
gl: Achegamento %dx.
he: זום x%d.
ko: 확대 %dx.
ru: Масштаб %dx.
uk: Масштаб %d.
vi: Thu phóng gấp %d lần.

# PARSE_STYLE_FAILED_DESC
source: The map failed to load because the style is corrupted.
bg: Картата не се зареди поради повреден стил.
ca: El mapa no s’ha carregat perquè s’ha corromput l’estil.
da: Kortet kunne ikke hentes på grund af en fejl
de: Die Karte konnte nicht geladen werden, da diese Form beschädigt ist.
es: No se pudo cargar el mapa debido a que el estilo está dañado.
fr: Le chargement de la carte a échoué car le style est corrompu.
gl: Non se puido cargar o mapa por mor de que o estilo está danado.
he: טעינת המפה נכשלה - הסגנון פגום.
hu: Nem sikerült betölteni a térképet, mert a stílus sérült.
ko: 형식에 오류가 발생하여 맵 로드에 실패하였습니다.
lt: Nepavyko užkrauti žemėlapio, nes stilius yra netinkamo formato.
pt_br: Falha ao carregar mapa porque o estilo está corrompido.
pt_pt: Não foi possível carregar o mapa porque o estilo está corrompido.
ru: Не удалось загрузить карту из-за ошибки в стиле.
sv: Misslyckades med att ladda kartan för att kartstilen är korrupt.
uk: Неможливо завантажити мапу через пошкоджений стиль.
vi: Bản đồ bị thất bại khi tải vì bảng kiểu bị hỏng.
zh_hant: 樣式表有毀損，無法載入地圖。

# ROAD_DIVIDED_A11Y_VALUE
source: Divided road
bg: Разделен път
da: Delt vej
es: Vía de doble carril
fr: Route à chaussées séparées
gl: Estrada de duplo carril
he: דרך מחולקת
ko: 분리 도로
pt_pt: Estrada dividida
ru: Двусторонняя дорога
sv: Delad väg
uk: Дорога з розподілювачем
vi: Đường phân làn

# ROAD_ONEWAY_A11Y_VALUE
source: One way
bg: Еднопосочно
da: Ensrettet
es: Unidireccional
fr: Route en sens unique
gl: Un só sentido
he: חד סטרי
ko: 일방 통행
pt_pt: Sentido único
ru: Односторонняя дорога
sv: Enkelriktad väg
uk: Односторонній рух
vi: Một chiều

# ROAD_REF_A11Y_FMT
source: Route %@
bg: Маршрут %@
da: Rute %@
es: Ruta %@
gl: Rota %@
he: כביש %@
ko: 경로 %@
pt_pt: Rota %@
ru: Трасса %@
sv: Rutt %@
uk: Маршрут %@
vi: Đường số %@

# SDK_NAME
source: Mapbox Maps SDK for iOS
bg: Mapbox Maps SDK за iOS
es: Mapbox Maps SDK para iOS
fr: SDK Mapbox Maps pour iOS
gl: Mapbox Maps SDK para o iOS
ko: iOS를 위한 맵박스 지도 SDK
pt_pt: Mapas Mapbox SDK para iOS
ru: Mapbox Maps SDK для iOS
uk: Mapbox Maps SDK для iOS
vi: Mapbox Maps SDK cho iOS

# SDK_UPDATE_AVAILABLE
source: Mapbox Maps SDK for iOS version %@ is now available:
bg: Mapbox Maps SDK за iOS версия %@ е вече налична:
ca: La versió %@ del Mapbox Maps SDK for iOS està disponible:
da: Mapbox Maps SDK for iOS version %@ er nu tilgængelig:
de: Mapbox Maps SDK for iOS Version %@ ist ab sofort verfügbar.
es: La versión %@ de Mapbox Maps SDK para iOS está disponible:
fr: Le SDK Mapbox Maps pour iOS en version %@ est maintenant disponible :
gl: A versión %@ do Mapbox Maps SDK para o iOS está dispoñíbel:
hu: Mapbox Maps SDK for iOS %@ mostantól elérhető:
ja: 現在Mapbox Maps SDK for iOS %1$@が入手できる：
ko: iOS버전 맵박스 지도 %@가 사용 가능합니다:
lt: Mapbox Maps SDK for iOS versija %@ jau prieinama.
pt_br: SDK Mapbox para iOS versão %@ está disponível:
pt_pt: Mapas Mapbox SDK para iOS na versão %@ está agora disponível:
ru: Доступна версия Mapbox Maps SDK %@ для iOS:
sv: Mapbox Maps SDK for iOS version %@ är nu tillgänglig:
uk: Mapbox Maps SDK для iOS версія %@ наявна:
vi: Mapbox Maps SDK cho iOS mới ra phiên bản %@:
zh_hant: Mapbox Maps SDK for iOS %@版現已開放下載：

# STYLE_NOT_FOUND_DESC
source: The map failed to load because the style can’t be found or is incompatible.
bg: Картата не се зареди поради неоткрит или несъвместим стил.
ca: El mapa no s’ha carregat perquè no es troba l’estil o bé és incompatible.
da: Kortet kunne ikke hentes fordi det enten ikke findes, eller ikke er kompatibelt.
de: Die Karte konnte nicht geladen werden, da diese Form nicht gefunden werden kann oder nicht kompatibel ist.
es: No se pudo cargar el mapa debido a que no se encuentra el estilo o está incompleto.
fr: Le chargement de la carte a échoué car le style n’a pas été trouvé ou est incompatible.
gl: Non se puido cargar o mapa por mor de que non se atopa o estilo ou non está completo.
he: טעינת המפה נכשלה - לא ניתן למצוא את הסגנון או שהסגנון אינו תואם.
hu: Nem sikerült betölteni a térképet, mert a stílus nem található vagy inkompatibilis.
ko: 형식을 찾을 수 없거나 호환이 되지 않아, 맵 로드에 실패하였습니다.
lt: Nepavyko užkrauti žemėlapio, nes neįmanoma rasti stiliaus arba jis nėra suderinamas.
pt_br: Falha ao carregar mapa porque o estilo não pode ser encontrado ou é incompatível.
pt_pt: Não foi possível carregar o mapa porque o estilo não foi encontrado ou é incompatível.
ru: Не удалось загрузить карту, так как стиль не найден или несовместим.
sv: Kartan kunde inte laddas för att kartstilen kunde inte hittas eller för att den är inkompatibel.
uk: Мапу неможливо завантажити через відсутність стилю або його невідповідність.
vi: Bản đồ bị thất bại khi tải vì không tìm thấy bảng kiểu hoặc bảng kiểu không tương thích.
zh_hant: 找不到樣式表或樣式表不兼容，無法載入地圖。

# TELEMETRY_DISABLED_MSG
source: You can help make OpenStreetMap and Mapbox maps better by contributing anonymous usage data.
ca: Pots ajudar a millorar els mapes d’OpenStreetMap i de Mapbox aportant dades d’ús anònimes.
da: Du kan hjælpe med at gøre OpenStreetMap og Mapbox kort bedre ved at bidrage med annonyme bruger data.
de: Durch anonymisierte Nutzungsdaten können Sie helfen, OpenStreetMap- und Mapbox-Karten zu verbessern.
es: Ayudas a mejorar los mapas de OpenStreetMap y Mapbox al aportar datos de uso anónimos.
fr: Vous pouvez aider à améliorer OpenStreetMap et Mapbox en contribuant des données anonymes d’utilisation.
gl: Axudas a mellorar os mapas do OpenStreetMap e o Mapbox ó contribuír con datos de emprego anónimos.
he: אתם מסייעים לשפר את המפות של OpenStreetMap ו Mapbox באמצעות שיתוף אנונימי של נתוני השימוש.
ko: 당신은 익명의 사용 데이타를 제공함으로써, 오픈스트리트맵과 맵박스의 향상에 기여하고 있습니다.
lt: Padėkite padaryti OpenStreetMap ir Mapbox žemėlapius geresniais dalindamiesi anoniminiais naudojimosi duomenimis.
pt_br: Você pode ajudar a tornar o OpenStreetMap e Mapbox ainda melhor contribuindo anonimamente com seus dados de uso.
pt_pt: Pode ajudar a tornar os mapas OpenStreetMap e Mapbox melhores contribuindo com dados de utilização anónimos.
ru: Вы поможете улучшить карты OpenStreetMap и Mapbox, предоставляя обезличенные данные об использовании.
sv: Du kan göra OpenStreetMap och Mapbox kartor bättre genom att bidra med anonym data.
uk: Ви можете допомогти зробити мапи OpenStreetMap та Mapbox кращими надаючи анонімізовані дані про користування застосунком.
vi: Hãy giúp cải tiến các bản đồ OpenStreetMap và Mapbox bằng cách đóng góp dữ liệu vô danh hóa về cách sử dụng.
zh_hans: 你可以提供匿名数据来帮助OpenStreetMap和Mapbox的地图变得更好。
zh_hant: 你可以提供匿名數據來幫助OpenStreetMap和Mapbox的地圖變得更好。

# TELEMETRY_DISABLED_OFF
source: Don’t Participate
bg: Не участвам
ca: No vull participar
da: Deltag ikke
de: Nicht teilnehmen
es: No participar
fr: Ne pas participer
gl: Non participar
he: אל תשתף
hu: Nem veszek részt
ja: 参加しない
ko: 참여하지 마십시오
lt: Nesidalinti
pt_br: Não Participar
pt_pt: Não Participar
ru: Не участвовать
sv: Delta Inte
uk: Відмовитись
vi: Không Tham gia
zh_hans: 暂不参与
zh_hant: 暫不參與

# TELEMETRY_DISABLED_ON
source: Participate
bg: Участвам
ca: Participar
da: Deltag
de: Teilnehmen
es: Participar
fr: Participer
gl: Participar
he: שתף
hu: Részt veszek
ja: 参加する
ko: 참여
lt: Dalintis
pt_br: Participar
pt_pt: Participar
ru: Участвовать
sv: Delta
uk: Брати участь
vi: Tham gia
zh_hans: 我要参与
zh_hant: 我要參與

# TELEMETRY_ENABLED_MSG
source: You are helping to make OpenStreetMap and Mapbox maps better by contributing anonymous usage data.
bg: Ти помагаш OpenStreetMap и Mapbox картите да стават по-добри, като предоставяш анонимни данни за употреба.
ca: Estàs ajudant a millorar els mapes d’OpenStreetMap i de Mapbox aportant dades d’ús anònimes.
da: Du hjælper med at gøre OpenStreetMap og Mapbox kort bedre ved at bidrage med annonyme bruger data.
de: Durch anonymisierte Nutzungsdaten helfen Sie, OpenStreetMap- und Mapbox-Karten zu verbessern.
es: Ayudas a mejorar los mapas de OpenStreetMap y Mapbox al aportar datos de uso anónimos.
fr: Vous aidez à rendre OpenStreetMap et Mapbox encore meilleurs en contribuant des données anonymes d’utilisation.
gl: Axudas a mellorar os mapas do OpenStreetMap e o Mapbox ó contribuír con datos de emprego anónimos.
he: אתם מסייעים לשפר את המפות של OpenStreetMap ו Mapbox באמצעות שיתוף אנונימי של נתוני השימוש.
ko: 당신은 익명의 사용 데이타를 제공함으로써, 오픈스트리트맵과 맵박스의 향상에 기여하고 있습니다.
lt: Jūs padedate padaryti OpenStreetMap ir Mapbox žemėlapius geresniais dalindamiesi anoniminiais naudojimosi duomenimis.
pt_br: Você está ajudando a tornar o OpenStreetMap e Mapbox ainda melhor contribuindo anonimamente com seus dados de uso.
pt_pt: Está a ajudar a tornar os mapas OpenStreetMap e Mapbox melhores contribuindo com dados de utilização anónimos.
ru: Вы помогаете улучшать карты OpenStreetMap и Mapbox, предоставляя обезличенные данные об использовании.
sv: Du kan göra OpenStreetMap och Mapbox kartor bättre genom att bidra med anonym data.
uk: Ви допомагаєте робити мапи OpenStreetMap та Mapbox краще пощирюючи анонімні дані про користування мапами.
vi: Bạn đang giúp cải tiến các bản đồ OpenStreetMap và Mapbox bằng cách đóng góp dữ liệu vô danh hóa về cách sử dụng.
zh_hans: 你的匿名数据在帮助OpenStreetMap和Mapbox的地图变得更好。
zh_hant: 你的匿名數據正在改善OpenStreetMap和Mapbox地圖。

# TELEMETRY_ENABLED_OFF
source: Stop Participating
bg: Спирам участие
ca: Aturar la participació
da: Stop deltagelse
de: Teilnahme beenden
es: Dejar de participar
fr: Arrêter de participer
gl: Deixar de participar
he: הפסק שיתוף
hu: Részvétel befejezése
ja: 参加をやめる
ko: 참여 중지
lt: Stabdyti dalinimąsi
pt_br: Parar de Participar
pt_pt: Parar de Participar
ru: Прекратить участие
sv: Sluta delta
uk: Припинити участь
vi: Ngừng Tham gia
zh_hans: 不再参与
zh_hant: 不再參與

# TELEMETRY_ENABLED_ON
source: Keep Participating
bg: Продължавам да участвам
ca: Continuar la participació
da: Fortsæt deltagelse
de: Weiterhin teilnehmen
es: Seguir participando
fr: Continuer à participer
gl: Seguir participando
he: המשך לשתף
hu: Részvétel folytatása
ja: 参加を続ける
ko: 참여 계속
lt: Tęsti dalinimąsi
pt_br: Continuar Participando
pt_pt: Continuar a Participar
ru: Продолжить участие
sv: Fortsätt delta
uk: Продовжити участь
vi: Tiếp tục Tham gia
zh_hans: 继续参与
zh_hant: 繼續參與

# TELEMETRY_MORE
source: Tell Me More
bg: Покажи ми още
ca: Vull saber-ne més
da: Fortæl mig mere
de: Mehr Informationen
es: Cuéntame más
fr: Dites m’en plus
gl: Cóntame máis
he: ספר לי עוד
hu: Többet akarok tudni
ja: 詳細
ko: 좀 더 말해보세요
lt: Daugiau informacijos
pt_br: Me Diga Mais
pt_pt: Quero Saber Mais
ru: Узнать больше
sv: Berätta mer
uk: Докладніше
vi: Tìm hiểu Thêm
zh_hans: 详细信息
zh_hant: 詳細信息

# TELEMETRY_NAME
source: Mapbox Telemetry
bg: Mapbox телеметрия
ca: Telemetria de Mapbox
de: Mapbox-Telemetrie
es: Telemetría Mapbox
fr: Télémétrie Mapbox
gl: Telemetría do Mapbox
hu: Mapbox telemetria
ja: Mapboxテレメトリー
ko: 맵박스 텔레메트리
lt: Mapbox Telemetrija
pt_br: Telemetria do Mapbox
pt_pt: Telemetria Mapbox
ru: Телеметрия Mapbox
sv: Mapbox Telemetri
uk: Телеметрія Mapbox
vi: Trình viễn trắc Mapbox
zh_hans: Mapbox传感数据
zh_hant: Mapbox遙測

# TELEMETRY_TITLE
source: Make Mapbox Maps Better
ca: Millora els mapes de Mapbox
da: Gør Mapbox kort bedre
de: Mapbox-Karten verbessern
es: Mejorar los mapas de Mapbox
fr: Rend meilleure les cartes Mapbox
gl: Mellorar os mapas do Mapbox
he: הפוך את המפות של Mapbox לטובות יותר
hu: Tedd jobbá a Mapbox térképeket
ja: Mapboxの地図を改善する
ko: 더 나은 맵박스 지도 만들기
lt: Padaryti Mapbox žemėlapius geresniais
pt_br: Melhorar os Mapas do Mapbox
pt_pt: Torne Melhores os Mapas Mapbox
ru: Сделать карты Mapbox лучше
sv: Gör Mapbox Kartor Bättre
uk: Допоможіть зробити мапи Mapbox краще
vi: Cải tiến các Bản đồ Mapbox
zh_hans: 让Mapbox地图变得更好
zh_hant: 讓Mapbox地圖變得更好

# USER_DOT_TITLE
source: You Are Here
ca: Ets aquí
da: Du er her
de: Sie sind hier
es: Usted está aquí
fr: Vous êtes ici
gl: Ti estás aquí
he: אתה נמצא כאן
hu: Itt vagy
ja: 現在位置
ko: 당신의 위치
lt: Jūs esate čia
pt_br: Você Está Aqui
pt_pt: Você Está Aqui
ru: Вы здесь
sv: Du är här
uk: Ви тут
vi: Bạn ở Đây
zh_hans: 你在这里
zh_hant: 你在這裡

# ROAD_DIRECTION_A11Y_FMT
source: %1$@ to %2$@
da: %1$@ til %2$@
es: %1$@ a %2$@
fr: %1$@ à %2$@
gl: %1$@ a %2$@
he: %1$@ אל %2$@
pt_pt: %1$@ para %2$@
ru: %1$@ на %2$@
sv: %1$@ till %2$@
uk: %1$@ до %2$@
vi: %1$@ sang %2$@
